tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "readline"
brew "sqlite"
brew "xz"
brew "awscli"
brew "gh"
brew "git"
brew "mas"
brew "nvm"
brew "openssl@3"
brew "pyenv"
brew "tmate"
brew "zlib"
brew "zsh"
cask "android-studio"
cask "clipy"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "mysqlworkbench"
cask "postman"
cask "visual-studio-code"
mas "Xcode", id: 497799835
