tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "bufbuild/buf"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
tap "spicetify/tap"
tap "wix/brew"
brew "xz"
brew "automake"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "aws-sam-cli"
brew "python@3.11"
brew "awscli"
brew "libssh2"
brew "bat"
brew "btop"
brew "harfbuzz"
brew "openjdk"
brew "bundletool"
brew "clang-format"
brew "clang-format@11"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "cowsay"
brew "cpufetch"
brew "rtmpdump"
brew "docutils"
brew "libevent"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "fastfetch"
brew "libtool"
brew "gh"
brew "ghostscript"
brew "git"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "grpcurl"
brew "pkg-config"
brew "guile"
brew "imagemagick"
brew "jq"
brew "krb5"
brew "libffi"
brew "libfido2"
brew "libgcrypt"
brew "libksba"
brew "libssh"
brew "libusb"
brew "libxml2"
brew "lolcat"
brew "lsd"
brew "mas"
brew "node"
brew "mongosh"
brew "zlib"
brew "mysql", restart_service: true
brew "openssl@1.1"
brew "python@3.10"
brew "node@14"
brew "node@16"
brew "nvm"
brew "openjdk@17"
brew "pgcli"
brew "php"
brew "pipx"
brew "postgresql@14"
brew "protobuf"
brew "pyenv"
brew "tcl-tk"
brew "python@3.8"
brew "python@3.9"
brew "rust"
brew "speedtest-cli"
brew "spicetify-cli"
brew "tmate"
brew "tmux"
brew "tmuxp"
brew "watchman"
brew "zsh"
brew "bufbuild/buf/buf"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/terraform"
brew "mongodb/brew/mongodb-community"
brew "wix/brew/applesimutils"
cask "1password"
cask "android-platform-tools"
cask "android-studio"
cask "cloudflare-warp"
cask "datagrip"
cask "detox-instruments"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "flipper"
cask "github"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "mattermost"
cask "mongodb-compass"
cask "mysqlworkbench"
cask "notion"
cask "nuage"
cask "obsidian"
cask "paintbrush"
cask "postman"
cask "prisma-studio"
cask "privadovpn"
cask "raindropio"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "termius"
cask "visual-studio-code"
cask "warp"
cask "webstorm"
cask "zed"
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "Hidden Bar", id: 1452453066
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "adamvoss.vscode-languagetool"
vscode "adpyke.codesnap"
vscode "alexcvzz.vscode-sqlite"
vscode "bierner.emojisense"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "cs50.ddb50"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "diemasmichiels.emulate"
vscode "donjayamanne.githistory"
vscode "dotenv.dotenv-vscode"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "icrawl.discord-vscode"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jock.svg"
vscode "kasik96.swift"
vscode "maptz.camelcasenavigation"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "meganrogge.template-string-converter"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-autoprefixer"
vscode "mrmlnc.vscode-stylefmt"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "nuintun.impsorter-vscode"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "quick-lint.quick-lint-js"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "shinotatwu-ds.file-tree-generator"
vscode "shopify.ruby-lsp"
vscode "swmansion.react-native-ide"
vscode "tauri-apps.tauri-vscode"
vscode "timonwong.shellcheck"
vscode "tonybaloney.vscode-pets"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "usernamehw.remove-empty-lines"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
vscode "xaver.clang-format"
vscode "yoavbls.pretty-ts-errors"
vscode "yy0931.save-as-root"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
